# AnalysisDisplayColoredSurfaceSettings Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayColoredSurfaceSettings Constructor
AnalysisDisplayColoredSurfaceSettings Class See Also
---
Constructs a default instance of colored surface settings.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public AnalysisDisplayColoredSurfaceSettings()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
AnalysisDisplayColoredSurfaceSettings()
```

# See Also
AnalysisDisplayColoredSurfaceSettings Class
AnalysisDisplayColoredSurfaceSettings Overload
Autodesk.Revit.DB.Analysis Namespace